Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: Added :wladmin:`cleanup_memory` management command to remove obsolete translation memory entries.
sv: Lagt till :wladmin:`cleanup_memory`-hanteringskommando fÃ¶r att ta bort fÃ¶rÃ¥ldrade Ã¶versÃ¤ttningsminnesposter.

source: Some flags are now added to a string by default, based on locations; see :ref:`location-based-flags`.
sv: Vissa flaggor lÃ¤ggs nu till i en strÃ¤ng som standard, baserat pÃ¥ platser; se :ref:`location-based-flags`.

source: Added :ref:`project-commit_policy` setting to control which translations are included when committing changes.
sv: Lagt till instÃ¤llningen :ref:`project-commit_policy` fÃ¶r att styra vilka Ã¶versÃ¤ttningar som ska inkluderas nÃ¤r Ã¤ndringar commitas.

source: :ref:`file_format_params` can now be configured at the component level.
sv: :ref:`file_format_params` kan nu konfigureras pÃ¥ komponentnivÃ¥.

source: New management command :wladmin:`list_file_format_params` to list all available file format parameters.
sv: Nytt kommando fÃ¶r administration :wladmin:`list_file_format_params` fÃ¶r att lista alla tillgÃ¤ngliga filformatsparametrar.

source: Tag and attribute names can now be customized for :ref:`flatxml` with :ref:`file_format_params`.
sv: Taggar och attributnamn kan nu anpassas fÃ¶r :ref:`flatxml` med :ref:`file_format_params`.

source: :ref:`search-strings` supports ``labels_count:NUMBER`` lookup.
sv: :ref:`search-strings` stÃ¶der ``labels_count:NUMBER``-uppslagning.

source: A new :envvar:`SENTRY_MONITOR_BEAT_TASKS` setting allows disabling Sentry monitoring of Celery Beat tasks.
sv: En ny instÃ¤llning :envvar:`SENTRY_MONITOR_BEAT_TASKS` gÃ¶r det mÃ¶jligt att inaktivera Sentry-Ã¶vervakning av Celery Beat-uppgifter.

source: :envvar:`WEBLATE_SOCIAL_AUTH_OIDC_TITLE` and :envvar:`WEBLATE_SOCIAL_AUTH_OIDC_IMAGE` allow configuring the appearance of the generic OIDC authentication.
sv: :envvar:`WEBLATE_SOCIAL_AUTH_OIDC_TITLE` och :envvar:`WEBLATE_SOCIAL_AUTH_OIDC_IMAGE` gÃ¶r det mÃ¶jligt att konfigurera utseendet pÃ¥ den generiska OIDC-autentiseringen.

source: Background commits are now identified by an internal user.
sv: BakgrundskommittÃ©er identifieras nu av en intern anvÃ¤ndare.

source: Reorganized navigation menu.
sv: Omorganiserat navigeringsmeny.

source: When editing a language definition, a warning about automated updates is shown; see :ref:`included-languages`.
sv: NÃ¤r du redigerar en sprÃ¥kteckning visas en varning om automatiska uppdateringar; se :ref:`included-languages`.

source: Avatars for API and internal accounts.
sv: Avatarer fÃ¶r API och interna konton.

source: Adding a new TOTP device removes the existing one by default; checkbox for not removing previous ones available.
sv: NÃ¤r du lÃ¤gger till en ny TOTP-enhet tas den befintliga bort som standard. Det finns en kryssruta fÃ¶r att inte ta bort tidigare enheter.

source: Creating pull or merge requests to remote repositories is no longer blocked by merge conflicts.
sv: Skapandet av pull- eller merge-fÃ¶rfrÃ¥gningar till fjÃ¤rrrepositorier blockeras inte lÃ¤ngre av merge-konflikter.

source: :ref:`check-rst-references` correctly handles Unicode punctuation and detects more issues.
sv: :ref:`check-rst-references` hanterar Unicode-interpunktion korrekt och upptÃ¤cker fler problem.

source: Migration towards Bootstrap 5 has started, selected views now use Bootstrap 5.
sv: ÃvergÃ¥ngen till Bootstrap 5 har pÃ¥bÃ¶rjats, utvalda vyer anvÃ¤nder nu Bootstrap 5.

source: :ref:`xliff` now supports starting from scratch when :ref:`adding-projects`.
sv: :ref:`xliff` stÃ¶der nu att bÃ¶rja frÃ¥n scratch nÃ¤r man :ref:`adding-projects`.

source: :ref:`mt-openai` compatibility with latest models.
sv: :ref:`mt-openai` kompatibilitet med de senaste modellerna.

source: :ref:`upload` correctly tracks authorship when using :guilabel:`Replace existing translation file`.
sv: :ref:`upload` spÃ¥rar korrekt upphovsmannaskap nÃ¤r man anvÃ¤nder :guilabel:`ErsÃ¤tt befintlig Ã¶versÃ¤ttningsfil`.

source: :ref:`mt-deepl` integration now correctly handles all supported source languages.
sv: :ref:`mt-deepl`-integrationen hanterar nu alla stÃ¶dda kÃ¤llsprÃ¥k korrekt.

source: Possible crash on macOS 15 in :samp:`strxfrm`.
sv: MÃ¶jlig krasch pÃ¥ macOS 15 i :samp:`strxfrm`.

source: Internal server error on permission denied while uploading files.
sv: Internt serverfel vid behÃ¶righetsnekad vid uppladdning av filer.

source: Some addons have been deprecated and replaced by :ref:`file_format_params`: :ref:`addon-weblate.gettext.customize`, :ref:`addon-weblate.json.customize`, :ref:`addon-weblate.yaml.customize`, :ref:`addon-weblate.xml.customize`.
sv: Vissa tillÃ¤gg har fasats ut och ersatts av :ref:`file_format_params`: :ref:`addon-weblate.gettext.customize`, :ref:`addon-weblate.json.customize`, :ref:`addon-weblate.yaml.customize`, :ref:`addon-weblate.xml.customize`.

source: :ref:`machine-translation`, :ref:`addon-weblate.autotranslate.autotranslate` and :http:post:`/api/translations/(string:project)/(string:component)/(string:language)/autotranslate/` now support all search operators, not only limited filters. Existing add-on configuration has been migrated. API users will need to adjust invocation.
sv: :ref:`machine-translation`, :ref:`addon-weblate.autotranslate.autotranslate` och :http:post:`/api/translations/(string:project)/(string:component)/(string:language)/autotranslate/` stÃ¶der nu alla sÃ¶koperatorer, inte bara begrÃ¤nsade filter. Befintlig tillÃ¤ggskonfiguration har migrerats. API-anvÃ¤ndare mÃ¥ste justera anropet.

source: The distributed locking now uses a different implementation and that introduced several changes in :file:`settings_example.py`, most notably ``BACKEND`` in ``CACHES`` needs to be changed.
sv: Den distribuerade lÃ¥sningen anvÃ¤nder nu en annan implementering och det har medfÃ¶rt flera Ã¤ndringar i :file:`settings_example.py`, framfÃ¶r allt mÃ¥ste ``BACKEND`` i ``CACHES`` Ã¤ndras.

source: The Docker container is now using :program:`granian`. This now requires explicit configuration of proxy trusted headers, including client protocol. :envvar:`WEBLATE_SECURE_PROXY_SSL_HEADER` typically needs to be added to avoid redirect loop, for example:
sv: Docker-containern anvÃ¤nder nu :program:`granian`. Detta krÃ¤ver nu en explicit konfiguration av proxy-betrodda rubriker, inklusive klientprotokoll. :envvar:`WEBLATE_SECURE_PROXY_SSL_HEADER` mÃ¥ste vanligtvis lÃ¤ggas till fÃ¶r att undvika omdirigeringsloopar, till exempel:

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/143?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/143?closed=1>`__.

source: *Released on June 20th 2025.*
sv: *SlÃ¤ppt den 20 juni 2025.*

source: :ref:`mt-deepl` integration now supports using next-gen LLM model.
sv: :ref:`mt-deepl`-integrationen stÃ¶der nu anvÃ¤ndning av nÃ¤sta generations LLM-modell.

source: Restoring :ref:`projectbackup` with votes.
sv: Ã terstÃ¤ller :ref:`projectbackup` med rÃ¶ster.

source: Improved error handling in :ref:`mt-apertium-apy`.
sv: FÃ¶rbÃ¤ttrad felhantering i :ref:`mt-apertium-apy`.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/148?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/148?closed=1>`__.

source: *Released on June 16th 2025.*
sv: *SlÃ¤pptes den 16 juni 2025.*

source: :ref:`sbom` now includes serial number.
sv: :ref:`sbom` innehÃ¥ller nu serienummer.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/147?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/147?closed=1>`__.

source: Exposure of personal IP address via e-mail (:cve:`2025-49134` / :ghsa:`4qqf-9m5c-w2c5`).
sv: Exponering av personlig IP-adress via e-post (:cve:`2025-49134` / :ghsa:`4qqf-9m5c-w2c5`).

source: Lack of rate limiting when verifying second factor (:cve:`2025-47951` / :ghsa:`57jg-m997-cx3q`).
sv: Bristande hastighetsbegrÃ¤nsning vid verifiering av andra faktorn (:cve:`2025-47951` / :ghsa:`57jg-m997-cx3q`).

source: Added :http:post:`/api/units/(int:id)/comments/` to create a new comment for the given translation unit.
sv: Lagt till :http:post:`/api/units/(int:id)/comments/` fÃ¶r att skapa en ny kommentar fÃ¶r den angivna Ã¶versÃ¤ttningsenheten.

source: :ref:`addon-weblate.json.customize` now has a configurable compact mode.
sv: :ref:`addon-weblate.json.customize` har nu ett konfigurerbart kompakt lÃ¤ge.

source: Added :ref:`check-kabyle-characters` quality check.
sv: Lagt till :ref:`check-kabyle-characters` kvalitetskontroll.

source: :ref:`sbom` is now being provided for Weblate.
sv: :ref:`sbom` tillhandahÃ¥lls nu fÃ¶r Weblate.

source: :doc:`/security/index` documentation.
sv: :doc:`/security/index` dokumentation.

source: Added support for :doc:`/formats/compose-multiplatform-resources`.
sv: Lagt till stÃ¶d fÃ¶r :doc:`/formats/compose-multiplatform-resources`.

source: Added :guilabel:`Translation Coordinator` role.
sv: Lagt till rollen :guilabel:`ÃversÃ¤ttningskoordinator`.

source: :ref:`addon-weblate.webhook.slack` is now available as an add-on.
sv: :ref:`addon-weblate.webhook.slack` finns nu tillgÃ¤ngligt som tillÃ¤gg.

source: Added :http:get:`/api/users/(str:username)/contributions/` to retrieve a list of all translations contributed by the user.
sv: Lagt till :http:get:`/api/users/(str:username)/contributions/` fÃ¶r att hÃ¤mta en lista Ã¶ver alla Ã¶versÃ¤ttningar som anvÃ¤ndaren har bidragit med.

source: :ref:`check-same` is now skipped for Toki Pona.
sv: :ref:`check-same` hoppas nu Ã¶ver fÃ¶r Toki Pona.

source: :ref:`search-strings` supports ``has:location`` lookup.
sv: :ref:`search-strings` stÃ¶der sÃ¶kning med ``has:location``.

source: Unicode whitespaces are now considered as problematic characters for :ref:`glossary`, see :ref:`check-prohibited-initial-character`.
sv: Unicode-mellanslag betraktas nu som problematiska tecken fÃ¶r :ref:`glossary`, se :ref:`check-prohibited-initial-character`.

source: :ref:`addon-weblate.webhook.webhook` logs are now displayed nicely.
sv: :ref:`addon-weblate.webhook.webhook`-loggar visas nu pÃ¥ ett Ã¶verskÃ¥dligt sÃ¤tt.

source: :ref:`addon-weblate.webhook.webhook` can be installed multiple times.
sv: :ref:`addon-weblate.webhook.webhook` kan installeras flera gÃ¥nger.

source: :ref:`user-profile` can now include contact URL.
sv: :ref:`user-profile` kan nu inkludera kontakt-URL.

source: :http:post:`/api/projects/` allows non-superusers to create projects when :ref:`billing` module is enabled.
sv: :http:post:`/api/projects/` tillÃ¥ter icke-superanvÃ¤ndare att skapa projekt nÃ¤r :ref:`billing`-modulen Ã¤r aktiverad.

source: :http:post:`/api/groups/` supports project-scoped team creation by non-superusers.
sv: :http:post:`/api/groups/` stÃ¶der skapande av projektbaserade team av icke-superanvÃ¤ndare.

source: :http:get:`/api/users/` now includes ``languages``.
sv: :http:get:`/api/users/` innehÃ¥ller nu ``languages``.

source: :ref:`addon-weblate.webhook.webhook` documentation improved.
sv: :ref:`addon-weblate.webhook.webhook` dokumentationen fÃ¶rbÃ¤ttrad.

source: Improved support for extended metadata in :ref:`tbx`.
sv: FÃ¶rbÃ¤ttrat stÃ¶d fÃ¶r utÃ¶kade metadata i :ref:`tbx`.

source: :ref:`addon-weblate.webhook.webhook` now includes a category field when available.
sv: :ref:`addon-weblate.webhook.webhook` innehÃ¥ller nu ett kategorifÃ¤lt nÃ¤r det Ã¤r tillgÃ¤ngligt.

source: Uploaded fonts can be updated and changes to them are tracked, see :ref:`fonts`.
sv: Uppladdade teckensnitt kan uppdateras och Ã¤ndringar spÃ¥ras, se :ref:`fonts`.

source: Weblate is now available in Bashkir language.
sv: Weblate finns nu tillgÃ¤ngligt pÃ¥ basjkiriska.

source: :ref:`dashboard` translations ordering when paginating.
sv: :ref:`dashboard` Ã¶versÃ¤ttningarnas ordning vid paginering.

source: Honor DeepL API Free glossary limits in :ref:`mt-deepl`.
sv: Hedra DeepL API Gratis ordlista begrÃ¤nsningar i :ref:`mt-deepl`.

source: :ref:`addon-weblate.webhook.webhook` delivery of project-wide events.
sv: :ref:`addon-weblate.webhook.webhook` leverans av projektomfattande hÃ¤ndelser.

source: False reports of :ref:`check-translated` with flags or explanation changes.
sv: Falska rapporter om :ref:`check-translated` med flaggor eller Ã¤ndringar i fÃ¶rklaringar.

source: Creating new translations in :doc:`/formats/appstore`.
sv: Skapa nya Ã¶versÃ¤ttningar i :doc:`/formats/appstore`.

source: :ref:`search-replace` correctly handles plurals.
sv: :ref:`search-replace` hanterar pluralformer korrekt.

source: The projects and categories default tab now shows translated languages.
sv: Fliken Standard fÃ¶r projekt och kategorier visar nu Ã¶versatta sprÃ¥k.

source: If no ``secret`` is provided in the Webhook add-on configuration, the Webhook request will not be signed, see :ref:`addon-weblate.webhook.webhook`.
sv: Om inget ``hemligt`` anges i konfigurationen fÃ¶r Webhook-tillÃ¤gget kommer Webhook-begÃ¤ran inte att signeras, se :ref:`addon-weblate.webhook.webhook`.

source: :ref:`saml-auth` support is no longer included in the default dependencies.
sv: :ref:`saml-auth`-stÃ¶d ingÃ¥r inte lÃ¤ngre i standardberoendena.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/141?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/141?closed=1>`__.

source: *Released on May 7th 2025.*
sv: *SlÃ¤pptes den 7 maj 2025.*

source: :ref:`addon-weblate.webhook.webhook` logs requests and responses.
sv: :ref:`addon-weblate.webhook.webhook` loggar fÃ¶rfrÃ¥gningar och svar.

source: :ref:`addon-weblate.webhook.webhook` was not triggered in some situations.
sv: :ref:`addon-weblate.webhook.webhook` aktiverades inte i vissa situationer.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/146?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/146?closed=1>`__.

source: *Released on May 3rd 2025.*
sv: *SlÃ¤pptes den 3 maj 2025.*

source: Fixed release publishing.
sv: Fast publiceringstidpunkt.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/145?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/145?closed=1>`__.

source: Glossary performance in zen mode and automatic suggestions.
sv: Ordlista i zen-lÃ¤ge och automatiska fÃ¶rslag.

source: Extended supported formats for :ref:`addon-weblate.json.customize`.
sv: UtÃ¶kade format som stÃ¶ds fÃ¶r :ref:`addon-weblate.json.customize`.

source: XML export no longer crashes on locations with special characters.
sv: XML-export kraschar inte lÃ¤ngre pÃ¥ platser med specialtecken.

source: Improved error handling on ZIP upload.
sv: FÃ¶rbÃ¤ttrad felhantering vid ZIP-uppladdning.

source: Django 5.2 compatibility.
sv: Kompatibilitet med Django 5.2.

source: Avoid repeated glossary synchronizations.
sv: Undvik upprepade synkroniseringar av ordlistan.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/144?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/144?closed=1>`__.

source: *Released on April 25th 2025.*
sv: *SlÃ¤pptes den 25 april 2025.*

source: :ref:`projectbackup` now include teams and categories.
sv: :ref:`projectbackup` inkluderar nu team och kategorier.

source: Docker health check is now supported in non-web service containers.
sv: Docker-hÃ¤lsokontroll stÃ¶ds nu i containrar som inte Ã¤r webbtjÃ¤nster.

source: :ref:`vcs-gitlab` integration now detects mergeârequest conflicts more robustly.
sv: :ref:`vcs-gitlab`-integrationen upptÃ¤cker nu konflikter i sammanfogningsfÃ¶rfrÃ¥gningar pÃ¥ ett mer robust sÃ¤tt.

source: :ref:`addon-weblate.webhook.webhook` is now enabled in Docker.
sv: :ref:`addon-weblate.webhook.webhook` Ã¤r nu aktiverat i Docker.

source: Removing pending glossary terms.
sv: Ta bort vÃ¤ntande ordlistetermer.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/142?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/142?closed=1>`__.

source: *Released on April 15th 2025.*
sv: *SlÃ¤pptes den 15 april 2025.*

source: Added :http:get:`/api/units/(int:id)/translations/` to retrieve a list of all target translation units for the given source translation unit.
sv: Lagt till :http:get:`/api/units/(int:id)/translations/` fÃ¶r att hÃ¤mta en lista Ã¶ver alla mÃ¥lÃ¶versÃ¤ttningsenheter fÃ¶r den angivna kÃ¤llÃ¶versÃ¤ttningsenheten.

source: Added :http:delete:`/api/groups/(int:id)/roles/(int:role_id)` to delete a role from a group.
sv: Lagt till :http:delete:`/api/groups/(int:id)/roles/(int:role_id)` fÃ¶r att ta bort en roll frÃ¥n en grupp.

source: :ref:`addon-weblate.webhook.webhook` is now available as an add-on.
sv: :ref:`addon-weblate.webhook.webhook` finns nu tillgÃ¤ngligt som tillÃ¤gg.

source: :ref:`check-automattic-components-format` check to validate placeholders in Automattic components.
sv: :ref:`check-automattic-components-format` kontrollera fÃ¶r att validera platshÃ¥llare i Automattic-komponenter.

source: Inherited flags can now be discarded, see :ref:`custom-checks`.
sv: Ãrvda flaggor kan nu kasseras, se :ref:`custom-checks`.

source: :ref:`secondary-languages` can now be specified in :ref:`project` and :ref:`component`.
sv: :ref:`secondary-languages` kan nu anges i :ref:`project` och :ref:`component`.

source: :ref:`mt-sources` can now be customized.
sv: :ref:`mt-sources` kan nu anpassas.

source: Weblate now uses OpenAPI Specification 3.1.1 to generate the schema for :ref:`api`.
sv: Weblate anvÃ¤nder nu OpenAPI Specification 3.1.1 fÃ¶r att generera schemat fÃ¶r :ref:`api`.

source: :ref:`credits` and :ref:`stats` include translator's join date. Additionally, both reports can be sorted either by the join date or the number of strings translated.
sv: :ref:`credits` och :ref:`stats` innehÃ¥ller Ã¶versÃ¤ttarens anslutningsdatum. Dessutom kan bÃ¥da rapporterna sorteras antingen efter anslutningsdatum eller efter antalet Ã¶versatta strÃ¤ngar.

source: Widgets show more precise stats.
sv: Widgets visar mer exakta statistik.

source: :ref:`upload` is now tracked in history with details.
sv: :ref:`upload` spÃ¥ras nu i historiken med detaljer.

source: :ref:`check-c-sharp-format` now supports ``csharp-format`` flag for compatibility with GNU gettext.
sv: :ref:`check-c-sharp-format` stÃ¶der nu flaggan ``csharp-format`` fÃ¶r kompatibilitet med GNU gettext.

source: Changes in string flags are now tracked in history.
sv: Ãndringar i strÃ¤ngflaggor spÃ¥ras nu i historiken.

source: :doc:`/admin/machine` documentation extended.
sv: :doc:`/admin/machine` dokumentation utÃ¶kad.

source: :ref:`addon-weblate.discovery.discovery` better handles hundreds of matches.
sv: :ref:`addon-weblate.discovery.discovery` hanterar hundratals trÃ¤ffar bÃ¤ttre.

source: Dismissing :ref:`checks` automatically updates propagated strings.
sv: AvfÃ¤rda :ref:`checks` uppdaterar automatiskt propagerade strÃ¤ngar.

source: :ref:`project-check_flags` can now also be configured on the project level.
sv: :ref:`project-check_flags` kan nu ocksÃ¥ konfigureras pÃ¥ projektnivÃ¥.

source: Improved rendering of :ref:`additional-flags` and :ref:`additional-explanation` changes in history.
sv: FÃ¶rbÃ¤ttrad Ã¥tergivning av :ref:`additional-flags` och :ref:`additional-explanation` Ã¤ndringar i historiken.

source: :ref:`mt-cyrtranslit` now automatically transliterates from a matching translation instead of the source strings.
sv: :ref:`mt-cyrtranslit` translittererar nu automatiskt frÃ¥n en matchande Ã¶versÃ¤ttning istÃ¤llet fÃ¶r frÃ¥n kÃ¤llstrÃ¤ngarna.

source: Errors from creating a duplicate glossary and failure to delete a glossary are now handled gracefully.
sv: Fel som uppstÃ¥r nÃ¤r man skapar en dubblett av en ordlista och misslyckas med att radera en ordlista hanteras nu pÃ¥ ett smidigt sÃ¤tt.

source: **Security:** Cloning a component could leak component configuration into the URL (:cve:`2025-32021`).
sv: **SÃ¤kerhet:** Kloning av en komponent kan leda till att komponentkonfigurationen lÃ¤cker ut i URL:en (:cve:`2025-32021`).

source: Fixed captcha verification when some time zone was configured.
sv: Fixade captcha-verifiering nÃ¤r vissa tidszoner var konfigurerade.

source: Improved translation propagation performance.
sv: FÃ¶rbÃ¤ttrad Ã¶versÃ¤ttningsspridningsprestanda.

source: Leading and trailing whitespace are now correctly stripped in glossary strings that also contain a :ref:`check-prohibited-initial-character`.
sv: Ledande och efterfÃ¶ljande blanktecken tas nu bort korrekt i ordlistestrÃ¤ngar som ocksÃ¥ innehÃ¥ller ett :ref:`check-prohibited-initial-character`.

source: Fixed background parsing of newly added translation files.
sv: Fast bakgrundsparsning av nyligen tillagda Ã¶versÃ¤ttningsfiler.

source: Registration now disallows disposable e-mail domains.
sv: Registrering tillÃ¥ter nu inte lÃ¤ngre engÃ¥ngs-e-postdomÃ¤ner.

source: The database migration updates indexes and this might take considerable time.
sv: Databasmigreringen uppdaterar index, vilket kan ta lÃ¥ng tid.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/136?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/136?closed=1>`__.

source: *Released on March 19th 2025.*
sv: *SlÃ¤pptes den 19 mars 2025.*

source: Fixed dismissing of checks.
sv: Fast avfÃ¤rdande av kontroller.

source: Reduced overhead of rendering other strings while translating.
sv: Minskad overhead fÃ¶r rendering av andra strÃ¤ngar under Ã¶versÃ¤ttning.

source: Improved performance of some :ref:`api` endpoints.
sv: FÃ¶rbÃ¤ttrad prestanda fÃ¶r vissa :ref:`api`-slutpunkter.

source: Fixed :ref:`language-parsing-codes` in some corner cases.
sv: Fixat :ref:`language-parsing-codes` i vissa specialfall.

source: :ref:`search-strings` now properly finds exact match on the component.
sv: :ref:`search-strings` hittar nu korrekt exakta matchningar pÃ¥ komponenten.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/140?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/140?closed=1>`__.

source: *Released on March 13th 2025.*
sv: *SlÃ¤ppt den 13 mars 2025.*

source: Captcha is not shown for registrations via :ref:`invite-user`.
sv: Captcha visas inte fÃ¶r registreringar via :ref:`invite-user`.

source: Improved performance of API download endpoints.
sv: FÃ¶rbÃ¤ttrad prestanda fÃ¶r API-nedladdningsÃ¤ndpunkter.

source: Optimized fetching other translations while translating.
sv: Optimerad hÃ¤mtning av andra Ã¶versÃ¤ttningar under Ã¶versÃ¤ttningen.

source: Reduced notifications overhead.
sv: Minskad overhead fÃ¶r aviseringar.

source: Improved handling of components using :ref:`internal-urls`.
sv: FÃ¶rbÃ¤ttrad hantering av komponenter med hjÃ¤lp av :ref:`internal-urls`.

source: Fixed authenticating with some Git servers.
sv: Fixat autentisering med vissa Git-servrar.

source: `All changes in detail <https://github.com/WeblateOrg/weblate/milestone/139?closed=1>`__.
sv: `Alla Ã¤ndringar i detalj <https://github.com/WeblateOrg/weblate/milestone/139?closed=1>`__.

source: *Released on February 28th 2025.*
sv: *SlÃ¤pptes den 28 februari 2025.*

source: Improved :ref:`translation-memory` matching.
sv: FÃ¶rbÃ¤ttrad :ref:`translation-memory`-matchning.

source: Visual diff now better highlights whitespace additions.
sv: Visuell diff markerar nu tillÃ¤gg av blanktecken tydligare.

source: Improved performance on large projects.
sv: FÃ¶rbÃ¤ttrad prestanda vid stora projekt.

source: Consistency of :ref:`search-boolean` in :doc:`/user/search`.
sv: Konsistens fÃ¶r :ref:`search-boolean` i :doc:`/user/search`.
